import backgroundPng from "../../assets/background.png";
import backgroundPng2 from "../../assets/background2.png";

const data = {
  frontEnd: {
    path: "front-end",
    title: "Front-End ծրագրավորում 0-ից",
    date: "Բաց դաս՝ դեկտեմբերի 3 (19:30)",
    background: backgroundPng,
    lastsMonths: ["6 ամիս", "72 դաս"],
    lastsDays: "3 օր",
    lastsHours: "1․5-2 ժամ",
    background2: backgroundPng2,
    price: "40․000դր",
    learningDescription: `Ծրագրավորումն ունի տարբեր ճյուղեր, որոնցից յուրաքանչյուրը նախատեսված է կոնկրետ գործողությունների համար։ Օրինակ՝ խաղերի ծրագրավորում, հեռախոսների և պլանշետների համար նախատեսված ծրագրերի ստեղծում, Web ծրագրավորում և այլն։ Դասընթացի ընթացքում կուսումնասիրեք Web ծրագրավորման ճյուղերից ՝ Front-End-ը (հարթակի Web ծրագրավորում):  Front-End ծրագրավորողը ստեղծում է կայքերի վիզուալ տեսքը այսինքն այն ամենը, ինչ օգտատերն այցելելով կայք՝ տեսնում է իր էկրանին։`,
    learningTopics: [
      {
        open: true,
        title: "Html",
        descriptions: [
          `HTML (HyperText Markup Language) վեբ կայքերի հիմքն է, այն ապահովում է վեբ էջի կառուցվածքը և բովանդակությունը՝ browser-ին ասելով, թե ինչ տարրեր պետք է  ցուցադրել էկրանին, օրինակ՝ տեքստ, պատկերներ, հղումներ, վերնագրեր և ցուցակներ:`,
          ` HTML-ը կայքի կմախքն է, որը հիմք է դնում նախքան որևէ ոճավորում (CSS) կամ ֆունկցիոնալություն (JavaScript) ավելացնելը:`,
        ],
        uls: [
          {
            title: "Կսովորես",
            list: [
              "Վեբ էջերի կառուցվածքը",
              "Տեքստի ձևաչափում",
              "Հղումներ և նավիգացիա",
              "Պատկերների և լրատվամիջոցների տեղադրում",
              "Աղյուսակներ և ցուցակներ",
              "SEO հիմունքներ",
            ],
          },
        ],
      },
      {
        title: "CSS",
        descriptions: [
          `HTML (HyperText Markup Language) վեբ կայքերի հիմքն է, այն ապահովում է վեբ էջի կառուցվածքը և բովանդակությունը՝ browser-ին ասելով, թե ինչ տարրեր պետք է  ցուցադրել էկրանին, օրինակ՝ տեքստ, պատկերներ, հղումներ, վերնագրեր և ցուցակներ:`,
          ` HTML-ը կայքի կմախքն է, որը հիմք է դնում նախքան որևէ ոճավորում (CSS) կամ ֆունկցիոնալություն (JavaScript) ավելացնելը:`,
        ],
        uls: [
          {
            title: "Կսովորես",
            list: [
              "Վեբ էջերի կառուցվածքը",
              "Տեքստի ձևաչափում",
              "Հղումներ և նավիգացիա",
              "Պատկերների և լրատվամիջոցների տեղադրում",
              "Աղյուսակներ և ցուցակներ",
              "SEO հիմունքներ",
            ],
          },
        ],
      },
      {
        title: "Javascript",
        descriptions: [
          `HTML (HyperText Markup Language) վեբ կայքերի հիմքն է, այն ապահովում է վեբ էջի կառուցվածքը և բովանդակությունը՝ browser-ին ասելով, թե ինչ տարրեր պետք է  ցուցադրել էկրանին, օրինակ՝ տեքստ, պատկերներ, հղումներ, վերնագրեր և ցուցակներ:`,
          ` HTML-ը կայքի կմախքն է, որը հիմք է դնում նախքան որևէ ոճավորում (CSS) կամ ֆունկցիոնալություն (JavaScript) ավելացնելը:`,
        ],
        uls: [
          {
            title: "Կսովորես",
            list: [
              "Վեբ էջերի կառուցվածքը",
              "Տեքստի ձևաչափում",
              "Հղումներ և նավիգացիա",
              "Պատկերների և լրատվամիջոցների տեղադրում",
              "Աղյուսակներ և ցուցակներ",
              "SEO հիմունքներ",
            ],
          },
        ],
      },
      {
        title: "ԱՆՎՃԱՐ անգլերեն",
        descriptions: [
          `HTML (HyperText Markup Language) վեբ կայքերի հիմքն է, այն ապահովում է վեբ էջի կառուցվածքը և բովանդակությունը՝ browser-ին ասելով, թե ինչ տարրեր պետք է  ցուցադրել էկրանին, օրինակ՝ տեքստ, պատկերներ, հղումներ, վերնագրեր և ցուցակներ:`,
          ` HTML-ը կայքի կմախքն է, որը հիմք է դնում նախքան որևէ ոճավորում (CSS) կամ ֆունկցիոնալություն (JavaScript) ավելացնելը:`,
        ],
        uls: [
          {
            title: "Կսովորես",
            list: [
              "Վեբ էջերի կառուցվածքը",
              "Տեքստի ձևաչափում",
              "Հղումներ և նավիգացիա",
              "Պատկերների և լրատվամիջոցների տեղադրում",
              "Աղյուսակներ և ցուցակներ",
              "SEO հիմունքներ",
            ],
          },
        ],
      },
    ],
    learningAdvantages: [
      `Դասաժամերը հարմարացնում ենք ձեր գրաֆիկին`,
      `Ունենք ինչպես գիշերային այնպես էլ ցերեկային խմբեր`,
      `Դասընթացի ավարտին կունենաք անձնական պորտֆոլիո՝ ձեր աշխատանքներով:`,
      `Լավագույն ուսանողները հնարավորություն կունենան անցնել պրակտիկա և աշխատել մեր կամ մեր գործընկեր 
կազմակերպություներում`,
      "Մեր ուսանողներին հետագա ցանկացած այլ կուրսի մասնակացելու դեպքում ՄԵԾ զեղչի տրամադրում",
    ],
    learningOutcome: [
      "Լիարժեք կտիրապետեք Front-End ծրագրավորման հիմունքներին և հիմնական գաղափարներին։",
      "Կկարողանաք ստեղծել ձեր ցանկացած դիզայնով և ֆունկցիոնալությամբ կայքեր",
      "Կհամապատասխանեք Հայաստանյան և նիջազգային IT կազմակերպություններում աշխատելու համար անհրաժեշտ պայմաններին։",
      "Կնախապատրաստվեք առաջիկա թե՛ տեսական, թե՛ գործնական հարցազրույցներին",
    ],
  },
};

export default data;
